public_html/org/Markups.html
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>Commonly used markups in org mode</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2010-05-13 08:58:04 "/>
<meta name="author" content=""/>
</head><body>
<h1 class="title">Commonly used markups in org mode</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Structural markup </a>
<ul>
<li><a href="#sec-1.1">1.1 Document title </a></li>
<li><a href="#sec-1.2">1.2 Heading </a></li>
<li><a href="#sec-1.3">1.3 Plain lists </a></li>
<li><a href="#sec-1.4">1.4 Emphasis and monospace </a></li>
<li><a href="#sec-1.5">1.5 Horizontal rules </a></li>
<li><a href="#sec-1.6">1.6 Comment lines </a></li>
</ul>
</li>
<li><a href="#sec-2">2 Images and Tables </a></li>
<li><a href="#sec-3">3 Literal examples </a>
<ul>
<li><a href="#sec-3.1">3.1 <code>BEGIN_EXAMPLE</code> </a></li>
<li><a href="#sec-3.2">3.2 colon </a></li>
<li><a href="#sec-3.3">3.3 <code>BEGIN_SRC</code> </a></li>
</ul>
</li>
<li><a href="#sec-4">4 Table </a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">1 Structural markup </h2>
<div id="text-1">


</div>

<div id="outline-container-1.1" class="outline-3">
<h3 id="sec-1.1">1.1 Document title </h3>
<div id="text-1.1">

<pre class="example">
#+Title: This is the title of the document
</pre>

</div>

</div>

<div id="outline-container-1.2" class="outline-3">
<h3 id="sec-1.2">1.2 Heading </h3>
<div id="text-1.2">

<pre class="example">
* Heading 1
** Heading 1.1
** Heading 1.2
*** Heading 1.2.1
*** Heading 1.2.2
* Heading 2
</pre>

</div>

</div>

<div id="outline-container-1.3" class="outline-3">
<h3 id="sec-1.3">1.3 Plain lists </h3>
<div id="text-1.3">

<p>My favorite scenes are (in this order)
</p><ol>
<li>
The attack of the Rohirrim
</li>
<li>
Eowyn's fight with the witch king
<ul>
<li>
this was already my favorite scene in the book
</li>
<li>
I really like Miranda Otto.
</li>
</ul>
</li>
<li>
Peter Jackson being shot by Legolas
<ul>
<li>
on DVD only
</li>
</ul>

<p>He makes a really funny face when it happens.
</p></li>
</ol>

<p>But in the end, no individual scenes matter but the film as a whole.
Important actors in this film are:
</p><dl>
<dt>Elijah Wood</dt><dd>
He plays Frodo
</dd>
<dt>Sean Austin</dt><dd>
He plays Sam, Frodo's friend.  I still remember
him very well from his role as Mikey Walsh in The Goonies.

</dd>
</dl>
</div>

</div>

<div id="outline-container-1.4" class="outline-3">
<h3 id="sec-1.4">1.4 Emphasis and monospace </h3>
<div id="text-1.4">


<pre class="example">
*bold*, /italic/, _underlined_,=code=,  ~verbatim~ and +strike-through+
</pre>
has the effect of
<b>bold</b>, <i>italic</i>, <span style="text-decoration:underline;">underlined</span>, <code>code</code>,  <code>verbatim</code> and <del>strike-through</del>:

</div>

</div>

<div id="outline-container-1.5" class="outline-3">
<h3 id="sec-1.5">1.5 Horizontal rules </h3>
<div id="text-1.5">

<pre class="example">
-----
</pre>
or more
<pre class="example">
--------
</pre>
produces

<hr/>
</div>

</div>

<div id="outline-container-1.6" class="outline-3">
<h3 id="sec-1.6">1.6 Comment lines </h3>
<div id="text-1.6">

<pre class="example">
#+BEGIN_COMMENT
Comment goes here
#+END_COMMENT
</pre>

</div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">2 Images and Tables </h2>
<div id="text-2">


</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3">3 Literal examples </h2>
<div id="text-3">


</div>

<div id="outline-container-3.1" class="outline-3">
<h3 id="sec-3.1">3.1 <code>BEGIN_EXAMPLE</code> </h3>
<div id="text-3.1">


<pre class="example">
#+BEGIN_EXAMPLE
Some example from a text file.
#+END_EXAMPLE
</pre>

</div>

</div>

<div id="outline-container-3.2" class="outline-3">
<h3 id="sec-3.2">3.2 colon </h3>
<div id="text-3.2">

<pre class="example">
:Another example code
</pre>

</div>

</div>

<div id="outline-container-3.3" class="outline-3">
<h3 id="sec-3.3">3.3 <code>BEGIN_SRC</code> </h3>
<div id="text-3.3">

<pre class="example">
#+BEGIN_SRC emacs-lisp
(defun org-xor (a b)
   "Exclusive or."
   (if a (not b) b))
#+END_SRC
</pre>

<pre class="example">
#+BEGIN_SRC emacs-lisp -n -r
(save-excursion                  (ref:sc)
   (goto-char (point-min))       (ref:jump)
#+END_SRC
In line [[(sc)]] we remember the current position.  [[(jump)][Line (jump)]]
jumps to point-min.
</pre>

</div>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4">4 Table </h2>
<div id="text-4">


<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<col align="left"></col><col align="left"></col><col align="left"></col>
<thead>
<tr><th>Name</th><th>Phone</th><th>Age</th></tr>
</thead>
<tbody>
<tr><td>&alpha;</td><td>&beta;</td><td>&Aacute;stor</td></tr>
<tr><td>&gamma;</td><td>&delta;</td><td>&chi;</td></tr>
</tbody>
</table>



</div>
</div>
<div id="postamble"><p class="author"> Author: 
<a href="mailto:zyl@ZHANGSISI">&lt;zyl@ZHANGSISI&gt;</a>
</p>
<p class="date"> Date: 2010-05-13 08:58:04 </p>
<p>HTML generated by org-mode 6.21b in emacs 23</p>
</div></body>
</html>
